import 'package:nutrition_app/Models/Category2.dart';

class Utils {
  static List<Category> getMockedCategories() {
    return [
      Category(
        id: 1,
        name: 'ขาดโบรอน (B)',
        description:
            '       ภายในใบปลายใบจะแสดงอาการใบหยิก ผิวใบไม่เรียบ ใบผิดรูปร่างในใบที่อ่อน ปลายใบย่อยจะงอเป็นรูปตะขอ สีใบยังเป็นสีเขียว',
        description2:
            '       สาเหตุ : ดินทรายจัด ดินด่าง ดินมีสารอินทรีย์ต่ำ มีไนโตรเจนสูง มีอากาศเย็นและเปียกชื้นละมีช่วงขาดน้ำ',
        description3:
            '       วิธีรักษา : ใส่โบแรกซ์ 20-30 กรัม/ต้น/ปี สำหรับปาล์มอายุ 2-3 ปีและ 100-150 กรัม/ต้น/ปี เมื่อปาล์มอายุ 4 ปีขึ้นไป',
        description4: '',
        description5: '',
        image: 'assets/images/imgnb.png',
        icon: '',
        color: 0xFFAFEEEE,
        imgName: "cat1",
      ),
      Category(
        id: 2,
        name: 'ขาดโพแทสเซียม (K)',
        description:
            '       อาการขาดธาตุโพแทสเซียมจะมีจุดสีส้ม โดยเริ่มพัฒนามาจากจุดสีเหลืองซีดบนใบ ถ้าอาการขาดรุนแรงจะพบเนื้อเยื่อตายบริเวณจุดสีส้มปลายใบ และขอบใบแห้ง',
        description2:
            '       สาเหตุ : ดินมีค่า ph ต่ำ สภาพแห้งแล้ง ฝนตกมากหรือมีการชะหน้าดินหนัก ดินเหนียวและมีโพรแทสเซียมอยู่น้อย',
        description3:
            '       วิธีรักษา : ใส่ปุ๋ยโพแทสเซียม สูตร 0-0-60 ต้นละ 3.0-4.0 กก./ต้น/ปี จะทำให้ต้นปาล์มน้ำมันปรับสภาพและให้ผลผลิตดีขึ้น',
        description4: '',
        description5: '',
        image: 'assets/images/imgnk.png',
        icon: '',
        color: 0xFFAFEEEE,
        imgName: "cat2",
      ),
      Category(
        id: 3,
        name: 'ขาดแมกนีเซียม (Mg)',
        description:
            '       ทางใบที่โตแล้วกลายเป็นสีเหลืองปนเขียว โดยเริ่มเกิดที่ปลายใบและขอบใบ และขยายไปยังฐานใบ ส่วนเส้นกลางใบยังคงเป็นสีเขียวอยู่ ',
        description2:
            '       สาเหตุ : ดินทรายจัด ดินกรด ดินมีโพแทสเซียมสูงและมีช่วงอากาศเย็นและชื้น',
        description3:
            '       วิธีรักษา : ใส่คีเซอร์ไรด์ (Kieserite) (27% MgO, 23% S) อัตราต้นละ 1.5 กก./ต้น/ปี',
        description4: '',
        description5: '',
        image: 'assets/images/imgnmg.png',
        icon: '',
        color: 0xFFAFEEEE,
        imgName: "cat3",
      ),
      Category(
        id: 4,
        name: 'ไม่ขาดธาตุอาหาร',
        description:
            'เมื่อได้ปุ๋ยที่ดีแล้ว วิธีการหรือเทคนิคในการใส่ปุ๋ยก็เป็นสิ่งสำคัญ เพื่อให้ต้นปาล์มน้ำมันได้รับธาตุอาหารจากปุ๋ยสูงสุด จึงมีแนวทางปฎิบัติดังนี้',
        description2:
            '1. กำจัดวัชพืชรอบโคนต้นให้สะอาด เพื่อให้ง่ายต่อการเก็บลูกร่วง',
        description3:
            '2. ใช้อินทรียวัตถุคลุมผิวดิน เช่น ทะลายเปล่า ปุ๋ยหมัก ปุ๋ยอินทรีย์ และให้เริ่มวางทางใบที่ตัดลงมาจากต้นไว้ระหว่างแถว',
        description4:
            '3. ถ้าตรวจวัดแล้วพบว่าถ้าดินเป็นกรด ให้ปรับค่ากรด-ด่างของดิน (pH) โดยการใส่ปูนโดโลไมท์ บริเวณกองทาง ปริมาณ 2-3 กิโลกรัม/ต้น/ปี',
        description5:
            '4. หว่านปุ๋ยบริเวณกองทาง ที่กองไว้ระหว่างต้นของต้นปาล์ม เพราะเป็นบริเวณที่รากอยู่มาก เนื่องจากมีความชื้นสูงและมีอินทรียวัตถุให้ปุ๋ยยึดเกาะ ช่วยลดการชะล้างของปุ๋ย',
        image: 'assets/images/imgnt.png',
        icon: '',
        color: 0xFFAFEEEE,
        imgName: "cat4",
      ),
      Category(
        id: 5,
        name: 'ไม่สามารถจำแนกได้',
        description:
            '       ปาล์มน้ำมันอาจจะขาดธาตุอาการที่จำเป็นอื่นๆ เช่น ไนโตรเจน(N) ฟอสฟอรัส(P) คอปเปอร์(Cu) หรือปาล์มน้ำมันอาจจะเป็นโรค ',
        description2:
            'ควรเลือกใส่ปุ๋ยสำหรับปาล์มน้ำมันที่ดี ซึ่งประกอบด้วยหลัก 3 ประการ คือ',
        description3:
            '1. ตรงตามความต้องการของต้นปาล์ม การศึกษาความต้องการธาตุอาหารของต้นปาล์มน้ำมัน ทำโดยการศึกษามวลชีวภาพและวิเคราะห์ความเข้มข้นของธาตุอาหารในส่วนต่างๆ ของต้น ได้แก่ ส่วนที่ไม่ถูกเคลื่อนย้ายออกจากแปลง เช่น ราก ลำต้น ทางใบ ช่อดอกเพศผู้ และส่วนที่นำออกจากแปลง คือ ผลผลิตทะลายปาล์ม ปริมาณธาตุอาหารที่ต้นปาล์มต้องการคือ ปริมาณธาตุอาหารที่ปรากฏในชิ้นส่วนต่างๆ ของต้นปาล์ม คำนวณจากผลคูณของมวลแห้งกับความเข้มข้นของธาตุอาหารแต่ละชนิด',
        description4:
            '2. ครบตามชนิดของธาตุอาหารที่จำเป็น พืชทุกชนิดต้องการธาตุอาหารที่จำเป็นสำหรับการเติบโตทั้งหมด 16 ชนิด แบ่งเป็น 3 ชนิด ได้จากอากาศและน้ำ คือ C, H, O ส่วนอีก 13 ชนิด ได้มาจากปุ๋ย แบ่งเป็นธาตุอาหารหลัก 6 ชนิด คือ N, P, K, S, Ca, Mg และจุลธาตุ 7 ชนิด คือ B, Cu, Zn, Mo, Cl, Fe และ Mn ต้นปาล์ม ต้องการจุลธาตุ B, Cu และ Zn อย่างชัดเจนต่อเนื่องมากกว่าจุลธาตุชนิดอื่น',
        description5:
            '3. ครบตามจำนวนสำหรับชดเชยผลผลิต ปริมาณของธาตุอาหาร สำหรับต้นปาล์มน้ำมันแบ่งเป็น 2 ส่วน คือ ใช้สำหรับเลี้ยงต้นส่วนที่เจริญอยู่ในแปลง ซึ่งมีปริมาณเพิ่มขึ้นต่อปีเฉลี่ยคงที่ ส่วนที่สอง ใช้สำหรับเลี้ยงผลผลิตทะลายปาล์มที่นำออกจากแปลง ซึ่งเพิ่มขึ้นตามระดับของผลผลิต ต้นปาล์มที่อายุเท่ากัน อาจจะมีผลผลิตได้ไม่เท่ากันขึ้นอยู่กับสายพันธุ์ การจัดการ และสภาพแวดล้อม การใส่ปุ๋ยตามระดับผลผลิตจึงเป็นสิ่งที่จะทำให้ได้ผลผลิตสูงและลดต้นทุนค่าปุ๋ยลง',
        image: 'assets/images/imgnn.png',
        icon: '',
        color: 0xFFAFEEEE,
        imgName: "cat5",
      ),
    ];
  }
}
